# pandas puzzles

Inspired by [100 Numpy exercises](https://github.com/rougier/numpy-100), here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these exercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects.

Many of the exercises here are straight-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python or Cython!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy*

**1.** Import pandas under the alias `pd`.

In [1]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'2.1.0'

**3.** Print out all the *version* information of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

D:\anaconda3\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit              : ba1cccd19da778f0c3a7d6a885685da16a072870
python              : 3.11.5.final.0
python-bits         : 64
OS                  : Windows
OS-release          : 10
Version             : 10.0.22631
machine             : AMD64
processor           : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder           : little
LC_ALL              : None
LANG                : None
LOCALE              : English_Australia.1252

pandas              : 2.1.0
numpy               : 1.24.3
pytz                : 2023.3.post1
dateutil            : 2.8.2
setuptools          : 67.8.0
pip                 : 24.0
Cython              : None
pytest              : 7.4.0
hypothesis          : None
sphinx              : 5.0.2
blosc               : None
feather             : None
xlsxwriter          : None
lxml.etree          : 4.9.3
html5lib            : None
pymysql             : None
psycopg2            : None
jinja2              : 3.1.2
IPython             : 8.15.0
pandas_datareader   : None
bs4                 : 4.12.2
bottleneck          : 1.3.5
dataframe-api-compat: None
fastparquet         : None
fsspec              : 2023.4.0
gcsfs               : None
matplotlib          : 3.8.0
numba               : 0.58.0
numexpr             : 2.8.7
odfpy               : None
openpyxl            : 3.0.10
pandas_gbq          : None
pyarrow             : 11.0.0
pyreadstat          : None
pyxlsb              : None
s3fs                : 2023.4.0
scipy               : 1.11.3
sqlalchemy          : 2.0.21
tables              : 3.8.0
tabulate            : 0.8.10
xarray              : 2023.6.0
xlrd                : 2.0.1
zstandard           : 0.19.0
tzdata              : 2023.3
qtpy                : 2.2.0
pyqt5               : None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [4]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=data, index=labels)

In [5]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**5.** Display a summary of the basic information about this DataFrame and its data (*hint: there is a single method that can be called on the DataFrame*).

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [7]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [8]:
df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [9]:
df.iloc[[3, 4, 8], :2]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [10]:
df.loc[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**10.** Select the rows where the age is missing, i.e. it is `NaN`.

In [11]:
df.loc[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [12]:
df.loc[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [13]:
df.loc[df['age'].between(2, 4, inclusive='both')]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**13.** Change the age in row 'f' to 1.5.

In [14]:
df.loc['f', 'age'] = 1.5
df.loc['f', 'age']

1.5

**14.** Calculate the sum of all visits in `df` (i.e. find the total number of visits).

In [15]:
df['visits'].sum()

19

**15.** Calculate the mean age for each different animal in `df`.

In [16]:
df.groupby(by='animal').agg('mean', numeric_only=True)['age']

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [17]:
df.loc['k', :] = {'animal': 'dragon', 'age': 1000, 'visits': 5, 'priority': 'yes'}

In [18]:
df

   animal     age  visits priority
a     cat     2.5     1.0      yes
b     cat     3.0     3.0      yes
c   snake     0.5     2.0       no
d     dog     NaN     3.0      yes
e     dog     5.0     2.0       no
f     cat     1.5     3.0       no
g   snake     4.5     1.0       no
h     cat     NaN     1.0      yes
i     dog     7.0     2.0       no
j     dog     3.0     1.0       no
k  dragon  1000.0     5.0      yes

**17.** Count the number of each type of animal in `df`.

In [19]:
df.groupby(by='animal').size()

animal
cat       4
dog       4
dragon    1
snake     2
dtype: int64

**18.** Sort `df` first by the values in the 'age' in *descending* order, then by the value in the 'visits' column in *ascending* order (so row `i` should be first, and row `d` should be last).

In [20]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

   animal     age  visits priority
k  dragon  1000.0     5.0      yes
i     dog     7.0     2.0       no
e     dog     5.0     2.0       no
g   snake     4.5     1.0       no
j     dog     3.0     1.0       no
b     cat     3.0     3.0      yes
a     cat     2.5     1.0      yes
f     cat     1.5     3.0       no
c   snake     0.5     2.0       no
h     cat     NaN     1.0      yes
d     dog     NaN     3.0      yes

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [21]:
mapper = {'yes': True, 'no': False}

df['priority'] = df['priority'].map(mapper)

In [22]:
df

   animal     age  visits  priority
a     cat     2.5     1.0      True
b     cat     3.0     3.0      True
c   snake     0.5     2.0     False
d     dog     NaN     3.0      True
e     dog     5.0     2.0     False
f     cat     1.5     3.0     False
g   snake     4.5     1.0     False
h     cat     NaN     1.0      True
i     dog     7.0     2.0     False
j     dog     3.0     1.0     False
k  dragon  1000.0     5.0      True

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [23]:
df['animal'].replace(to_replace='snake', value='python', inplace=True)

In [24]:
df

   animal     age  visits  priority
a     cat     2.5     1.0      True
b     cat     3.0     3.0      True
c  python     0.5     2.0     False
d     dog     NaN     3.0      True
e     dog     5.0     2.0     False
f     cat     1.5     3.0     False
g  python     4.5     1.0     False
h     cat     NaN     1.0      True
i     dog     7.0     2.0     False
j     dog     3.0     1.0     False
k  dragon  1000.0     5.0      True

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (*hint: use a pivot table*).

In [25]:
df.groupby(by=['animal', 'visits'])['age'].agg('mean')

animal  visits
cat     1.0          2.50
        3.0          2.25
dog     1.0          3.00
        2.0          6.00
        3.0           NaN
dragon  5.0       1000.00
python  1.0          4.50
        2.0          0.50
Name: age, dtype: float64

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

In [26]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [27]:
# Using .shift() to find the value of the row immediately above the current
previous_values = df['A'].shift(1)

# Filtering for matching values only
df.loc[df['A'] == previous_values]

    A
2   2
6   5
7   5
10  7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [28]:
df = pd.DataFrame(np.random.random(size=(5, 3)))

In [29]:
df

          0         1         2
0  0.917544  0.629682  0.601711
1  0.309976  0.445045  0.597464
2  0.723779  0.179167  0.430945
3  0.727149  0.164121  0.290283
4  0.979001  0.282152  0.912230

In [30]:
# row means
df.mean(axis=1)

0    0.716312
1    0.450829
2    0.444630
3    0.393851
4    0.724461
dtype: float64

In [31]:
df.apply(lambda x: x - df.mean(axis=1), axis=0)

          0         1         2
0  0.201232 -0.086630 -0.114601
1 -0.140852 -0.005784  0.146636
2  0.279149 -0.265464 -0.013685
3  0.333298 -0.229730 -0.103568
4  0.254540 -0.442309  0.187769

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum?  Return that column's label.

In [32]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.937038,0.828423,0.908320,0.858029,0.669824,0.399107,0.143970,0.461941,0.83003,0.354051
1,0.206585,0.359877,0.823004,0.129778,0.257755,0.591960,0.436425,0.921305,0.03920,0.330697
2,0.371508,0.470881,0.365295,0.210352,0.782480,0.564960,0.277806,0.484899,0.04530,0.520759
3,0.848906,0.656104,0.638913,0.156923,0.533799,0.952758,0.254975,0.793091,0.36834,0.985835
4,0.496098,0.593274,0.945860,0.800237,0.511407,0.913836,0.350350,0.984151,0.04717,0.321161

In [33]:
# Column sums
col_sum = df.sum(axis=0)
col_sum

a    2.860134
b    2.908558
c    3.681392
d    2.155319
e    2.755265
f    3.422622
g    1.463526
h    3.645387
i    1.330040
j    2.512502
dtype: float64

In [34]:
col_sum.idxmin()

'i'

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

```python
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
```

In [35]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  1  1  0
1  1  0  0
2  0  1  0
3  0  1  1
4  1  1  1
5  1  0  0
6  0  1  0
7  1  0  0
8  1  0  1
9  0  0  1

In [36]:
(~df.duplicated()).sum()

7

The next three puzzles are slightly harder.


**26.** In the cell below, you have a DataFrame `df` that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the *column* which contains the *third* NaN value.

You should return a Series of column labels: `e, c, d, h, d`

In [37]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)
df

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [38]:
df.isna()

       a     b      c      d      e      f      g      h      i      j
0  False  True   True  False   True  False  False  False   True   True
1   True  True   True  False  False   True   True  False  False  False
2   True  True  False   True  False  False   True   True  False  False
3  False  True   True  False  False  False  False   True   True   True
4   True  True  False   True  False   True  False   True  False  False

In [39]:
# write a solution to the question here

# function used to identify the location of the 3rd NaN
def finding_nth_nan_in_row(row, value_occurence):
    value_frequency = 0
    for i, value in enumerate(row):
        if pd.isna(value):
            value_frequency += 1
            if value_frequency == value_occurence:
                return i

In [40]:
df.apply(finding_nth_nan_in_row, value_occurence=3, axis=1)

0    4
1    2
2    3
3    7
4    3
dtype: int64

In [41]:
matching_col_label = df.columns[df.apply(finding_nth_nan_in_row, value_occurence=3, axis=1)]
matching_col_label

Index(['e', 'c', 'd', 'h', 'd'], dtype='object')

**27.** A DataFrame has a column of groups 'grps' and and column of integer values 'vals':

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values. You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [42]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [43]:
# write a solution to the question here

# Filtering for the top 3 greatest values
top_3_by_group = df.groupby(by='grps')['vals'].nlargest(3)
top_3_by_group

grps
a     1     345
      7      52
      0      12
b     12     57
      8      54
      4      45
c     10    235
      14     87
      9      23
Name: vals, dtype: int64

In [44]:
top_3_by_group.groupby(by='grps').sum()

grps
a    409
b    156
c    345
Name: vals, dtype: int64

**28.** The DataFrame `df` constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive).

For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

The answer should be a Series as follows:

```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [45]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])
df

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

In [46]:
new_df = df.copy()

In [47]:
# write a solution to the question here

In [48]:
new_df['bin'] = pd.cut(new_df['A'], bins=int(round(len(new_df['A'])/10, 0)), right=True, precision=0)
new_df

     A   B            bin
0   46  29   (41.0, 50.0]
1   75  22   (70.0, 80.0]
2   49  63   (41.0, 50.0]
3   33  43   (31.0, 41.0]
4   71  75   (70.0, 80.0]
..  ..  ..            ...
95  60  87   (50.0, 60.0]
96  57  40   (50.0, 60.0]
97  86  19   (80.0, 90.0]
98  50  56   (41.0, 50.0]
99  97  94  (90.0, 100.0]

[100 rows x 3 columns]

In [49]:
new_df.groupby(by='bin')['B'].sum()

C:\Users\huyph\AppData\Local\Temp\ipykernel_57420\2002746301.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  new_df.groupby(by='bin')['B'].sum()

bin
(1.0, 11.0]      635
(11.0, 21.0]     360
(21.0, 31.0]     315
(31.0, 41.0]     306
(41.0, 50.0]     750
(50.0, 60.0]     284
(60.0, 70.0]     424
(70.0, 80.0]     526
(80.0, 90.0]     835
(90.0, 100.0]    852
Name: B, dtype: int32

## DataFrames: harder problems

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be

```
[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
```

Make this a new column 'Y'.

In [50]:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [51]:
new_df = df.reset_index()
new_df['index']
new_df

   index  X
0      0  7
1      1  2
2      2  0
3      3  3
4      4  4
5      5  2
6      6  5
7      7  0
8      8  3
9      9  4

In [52]:
# Find value of 'index' column where 'X' = 0
list_index_0 = list(new_df.loc[new_df['X']==0, 'index'])
list_index_0

[2, 7]

In [53]:
# Create bins of min and max of 'index' column
bins = [new_df['index'].min(), new_df['index'].max()]
bins

[0, 9]

In [54]:
# Add to bins the 'index' values where 'X'=0
bins.extend(list_index_0)
bins = sorted(bins)

In [55]:
new_df['index_bracket'] = pd.cut(new_df['index'], bins=bins, include_lowest=True, right=True, precision=0)
new_df

   index  X index_bracket
0      0  7       (-1, 2]
1      1  2       (-1, 2]
2      2  0       (-1, 2]
3      3  3        (2, 7]
4      4  4        (2, 7]
5      5  2        (2, 7]
6      6  5        (2, 7]
7      7  0        (2, 7]
8      8  3        (7, 9]
9      9  4        (7, 9]

In [56]:
# Finding the minimum 'index' value of each bin
min_by_bin = new_df.groupby(by='index_bracket')['index'].min()
min_by_bin

C:\Users\huyph\AppData\Local\Temp\ipykernel_57420\2949546099.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  min_by_bin = new_df.groupby(by='index_bracket')['index'].min()

index_bracket
(-1, 2]    0
(2, 7]     3
(7, 9]     8
Name: index, dtype: int64

In [57]:
count_diff = new_df['index'] - new_df.groupby(by='index_bracket')['index'].transform('min') + 1
count_diff

C:\Users\huyph\AppData\Local\Temp\ipykernel_57420\41564320.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  count_diff = new_df['index'] - new_df.groupby(by='index_bracket')['index'].transform('min') + 1

0    1
1    2
2    3
3    1
4    2
5    3
6    4
7    5
8    1
9    2
Name: index, dtype: int64

In [58]:
count_diff[list_index_0] = 0
count_diff

0    1
1    2
2    0
3    1
4    2
5    3
6    4
7    0
8    1
9    2
Name: index, dtype: int64

In [59]:
final_result = list(count_diff)
final_result

[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

**30.** Consider the DataFrame constructed below which contains rows and columns of numerical data.

Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:
```
[(5, 7), (6, 4), (2, 5)]
```

In [60]:
df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))
df

    0   1   2   3   4   5   6   7
0  38  38  46  46  13  24   3  54
1  18  47   4  42   8  66  50  46
2  62  36  19  19  77  17   7  63
3  28  47  46  65  63  12  16  24
4  14  51  34  56  29  59  92  79
5  58  76  96  45  38  76  58  40
6  10  34  48  40  37  23  41  26
7  55  70  91  27  79  92  20  31

In [61]:
# Top 3 largest values
top_3_largest = list(df.apply(lambda x: max(x), axis=0).nlargest(3).values)
top_3_largest

[96, 92, 92]

In [62]:
# index of top 3 largest values
top_3_index = df.apply(lambda x: max(x), axis=1).nlargest(3).index
top_3_index

Index([5, 4, 7], dtype='int64')

In [63]:
# row and column of top 3 largest values
top_3_row_column = df.loc[top_3_index, :].idxmax(axis=1)
top_3_row_column

5    2
4    6
7    5
dtype: int64

In [64]:
for i, value in enumerate(top_3_row_column):
    print(i, value)

0 2
1 6
2 5

In [65]:
final_result = [(column, row) for row, column in zip(top_3_row_column.index, top_3_row_column.values)]
final_result

[(2, 5), (6, 4), (5, 7)]

**31.** You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.

```python
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15),
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
```

Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

```
    vals grps  patched_vals
0    -12    A          13.6
1     -7    B          28.0
2    -14    A          13.6
3      4    A           4.0
4     -7    A          13.6
5     28    B          28.0
6     -2    A          13.6
7     -1    A          13.6
8      8    A           8.0
9     -2    B          28.0
10    28    A          28.0
11    12    A          12.0
12    16    A          16.0
13   -24    A          13.6
14   -12    A          13.6
```

In [66]:
df = pd.DataFrame(
    {"grps": np.random.RandomState(31).choice(["A", "B"], 15)
    , "vals": np.random.RandomState(31).randint(-30, 30, size=15)}
    )
df

   grps  vals
0     A   -12
1     B    -7
2     A   -14
3     A     4
4     A    -7
5     B    28
6     A    -2
7     A    -1
8     A     8
9     B    -2
10    A    28
11    A    12
12    A    16
13    A   -24
14    A   -12

In [67]:
df_positive = df.loc[df['vals']>0]
df_positive

   grps  vals
3     A     4
5     B    28
8     A     8
10    A    28
11    A    12
12    A    16

In [68]:
positive_means = df_positive.groupby(by='grps')['vals'].mean()
positive_means

grps
A    13.6
B    28.0
Name: vals, dtype: float64

In [69]:
avg_postive_A = positive_means['A']
avg_postive_B = positive_means['B']

print(f"avg of group A postive: {avg_postive_A}")
print(f"avg of group B postive: {avg_postive_B}")

avg of group A postive: 13.6
avg of group B postive: 28.0

In [70]:
df['patched_values'] = df.apply(lambda x: x['vals'] if x['vals'] >= 0 else (avg_postive_A if x['grps'] == 'A' else avg_postive_B), axis=1)
df

   grps  vals  patched_values
0     A   -12            13.6
1     B    -7            28.0
2     A   -14            13.6
3     A     4             4.0
4     A    -7            13.6
5     B    28            28.0
6     A    -2            13.6
7     A    -1            13.6
8     A     8             8.0
9     B    -2            28.0
10    A    28            28.0
11    A    12            12.0
12    A    16            16.0
13    A   -24            13.6
14    A   -12            13.6

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

In [71]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [72]:
rolling_df = df.groupby(by='group', as_index=False)['value'].rolling(window=3, min_periods=1).mean()
rolling_df

   group     value
0      a  1.000000
1      a  1.500000
4      a  1.666667
8      a  3.666667
10     a  4.500000
2      b  3.000000
3      b  3.000000
5      b  3.000000
6      b  3.000000
7      b  2.000000
9      b  2.000000
11     b  4.000000

In [73]:
final_result = rolling_df['value'].sort_index(ascending=True)
final_result

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [74]:
date_range_index = pd.date_range(start='2015-01-01', end='2015-12-31', freq='D')
date_range_index

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2015-12-22', '2015-12-23', '2015-12-24', '2015-12-25',
               '2015-12-26', '2015-12-27', '2015-12-28', '2015-12-29',
               '2015-12-30', '2015-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [75]:
s = pd.Series(data=np.random.RandomState(27).randn(365), index=date_range_index)
s

2015-01-01    1.285605
2015-01-02   -0.303553
2015-01-03    0.619076
2015-01-04    0.395999
2015-01-05    0.223406
                ...
2015-12-27   -1.705819
2015-12-28   -0.499663
2015-12-29    0.461564
2015-12-30   -1.413413
2015-12-31    0.548499
Freq: D, Length: 365, dtype: float64

**34.** Find the sum of the values in `s` for every Wednesday.

In [76]:
s.loc[s.index.weekday == 2].sum()

-0.5477132565981928

**35.** For each calendar month in `s`, find the mean of values.

In [77]:
s.resample('M', kind='period').mean()

2015-01   -0.021761
2015-02    0.500637
2015-03   -0.119217
2015-04    0.059097
2015-05    0.294104
2015-06   -0.266925
2015-07   -0.006303
2015-08    0.083646
2015-09   -0.001771
2015-10   -0.370543
2015-11    0.141643
2015-12   -0.243347
Freq: M, dtype: float64

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [78]:
monthly_max = s.resample('M', kind='period').max()
monthly_max

2015-01    1.285605
2015-02    2.571868
2015-03    1.286004
2015-04    1.508073
2015-05    2.370095
2015-06    1.542190
2015-07    3.132310
2015-08    2.033892
2015-09    1.825006
2015-10    1.961404
2015-11    2.037767
2015-12    1.714920
Freq: M, dtype: float64

In [79]:
rolling_max_4_months = monthly_max.rolling(window=4).max()
rolling_max_4_months

2015-01         NaN
2015-02         NaN
2015-03         NaN
2015-04    2.571868
2015-05    2.571868
2015-06    2.370095
2015-07    3.132310
2015-08    3.132310
2015-09    3.132310
2015-10    3.132310
2015-11    2.037767
2015-12    2.037767
Freq: M, dtype: float64

In [80]:
rolling_max_4_months.values

array([       nan,        nan,        nan, 2.57186778, 2.57186778,
       2.37009469, 3.13230978, 3.13230978, 3.13230978, 3.13230978,
       2.0377668 , 2.0377668 ])

In [81]:
s[s.isin(rolling_max_4_months)]

2015-02-02    2.571868
2015-05-15    2.370095
2015-07-18    3.132310
2015-11-24    2.037767
dtype: float64

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [82]:
date_index_3rd_thursday = pd.date_range(start='2015-01-01', end='2016-12-31', freq='WOM-3THU')
date_index_3rd_thursday

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
```
Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```


(It's some flight data I made up; it's not meant to be accurate in any way.)

**38.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

In [83]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [84]:
df.reset_index()

   index           From_To  FlightNumber  RecentDelays              Airline
0      0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      1      MAdrid_miLAN           NaN            []    <Air France> (12)
2      2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3      3    Budapest_PaRis           NaN          [13]       12. Air France
4      4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [85]:
# series containing an increasing list of numbers by 10 with each row
increasing_series = df['FlightNumber'].ffill() + 10
increasing_series

0    10055.0
1    10055.0
2    10075.0
3    10075.0
4    10095.0
Name: FlightNumber, dtype: float64

In [86]:
df['FlightNumber'].fillna(increasing_series, inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**39.** The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [87]:
temp = df['From_To'].str.split('_', expand=True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [88]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**41.** Delete the **From_To** column from `df` and attach the temporary DataFrame 'temp' from the previous questions.

In [89]:
df.drop(columns='From_To', inplace=True)

In [90]:
df = pd.concat([df, temp], axis=1)

In [91]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

**42**. In the **Airline** column, you can see some extra punctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [92]:
import re

In [93]:
df['Airline'] = df['Airline'].str.replace(r'[^\w\s]|[\d]', '', regex=True).str.strip()

In [94]:
df

   FlightNumber  RecentDelays          Airline      From         To
0       10045.0      [23, 47]              KLM    London      Paris
1       10055.0            []       Air France    Madrid      Milan
2       10065.0  [24, 43, 87]  British Airways    London  Stockholm
3       10075.0          [13]       Air France  Budapest      Paris
4       10085.0      [67, 32]        Swiss Air  Brussels     London

**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

The DataFrame should look much better now.
```
   FlightNumber          Airline      From         To  delay_1  delay_2  delay_3
0         10045              KLM    London      Paris     23.0     47.0      NaN
1         10055       Air France    Madrid      Milan      NaN      NaN      NaN
2         10065  British Airways    London  Stockholm     24.0     43.0     87.0
3         10075       Air France  Budapest      Paris     13.0      NaN      NaN
4         10085        Swiss Air  Brussels     London     67.0     32.0      NaN
```

In [95]:
delays = pd.DataFrame(list(df['RecentDelays']))

In [96]:
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [97]:
df.drop(columns='RecentDelays', inplace=True)

In [98]:
df

   FlightNumber          Airline      From         To
0       10045.0              KLM    London      Paris
1       10055.0       Air France    Madrid      Milan
2       10065.0  British Airways    London  Stockholm
3       10075.0       Air France  Budapest      Paris
4       10085.0        Swiss Air  Brussels     London

In [111]:
columns_name = ['delay_' + str(i + 1) for i in range(len(delays.columns))]
delays.columns = column_names

In [112]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [113]:
df = pd.concat([df, delays], axis=1)

In [114]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM,London,Paris,23.0,47.0,NaN
1,10055.0,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065.0,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075.0,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,Brussels,London,67.0,32.0,NaN

# HOORAY!!! I've finished this lab. It was really a tough challenge